app/views/shelters/show.html.erb

SELECT "animals".* FROM "animals" WHERE "animals"."shelter_id" = ?  [["shelter_id", 1]]
---

<% @shelter.animals.each do |animal| %>