app/views/animals/index.html.erb

SELECT "type_of_animals".* FROM "type_of_animals"
SELECT "animals".* FROM "animals"
---
<%=form_tag animals_path, method: :get%>
<%=collection_select :animal,:type_of_animal_id, TypeOfAnimal.all, :name, :name %>