app/views/animals/new.html.erb

SELECT "type_of_animals".* FROM "type_of_animals"
---
<%= f.label :type%>
<%= f.collection_select :type_of_animal_id, TypeOfAnimal.all, :id, :name%><br>

SELECT "shelters".* FROM "shelters"
---
<%= f.label :shelter%>
<%= f.collection_select :shelter_id, Shelter.all, :id, :name%><br>