app/views/animals/new.html.erb

SELECT "animal_breeds".* FROM "animal_breeds"
---
  <datalist id="animal_breed">
    <%AnimalBreed.all.each do |animal_breed|%>

SELECT "shelters".* FROM "shelters"
---
<%= f.label :shelter%>
<%= f.collection_select :shelter_id, Shelter.all, :id, :name%><br>