app/controllers/animals_controller.rb

SELECT "animals".* FROM "animals"
---
  def index
    if params[:animal]
      @animals = Animal.filter(params[:animal][:type_of_animal_id])
    else
      @animals = Animal.all

INSERT INTO "type_of_animals" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "snake"], ["created_at", "2018-08-01 18:18:52.101782"], ["updated_at", "2018-08-01 18:18:52.101782"]]
INSERT INTO "animals" ("name", "description", "shelter_id", "created_at", "updated_at", "type_of_animal_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "sam"], ["description", "hes a snake"], ["shelter_id", 3], ["created_at", "2018-08-01 18:18:52.368805"], ["updated_at", "2018-08-01 18:18:52.368805"], ["type_of_animal_id", 11]]
SELECT  "type_of_animals".* FROM "type_of_animals" WHERE "type_of_animals"."name" = ? LIMIT ?  [["name", "Dog"], ["LIMIT", 1]]
INSERT INTO "animals" ("name", "age", "description", "shelter_id", "created_at", "updated_at", "type_of_animal_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Doggo"], ["age", 10], ["description", "happy"], ["shelter_id", 1], ["created_at", "2018-08-03 13:36:11.198734"], ["updated_at", "2018-08-03 13:36:11.198734"], ["type_of_animal_id", 1]]
---
  def create
    @animal = Animal.new(animal_params)

    anim = params[:animal_type]
    type = TypeOfAnimal.find_or_create_by(name: anim)
    @animal.type_of_animal_id = type[:id]

    # debugger
    if @animal.valid?
      # debugger
      @animal.save

SELECT  "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
  def show
    @animal = Animal.find(params[:id])