app/controllers/shelters_controller.rb

  def index
    @shelters = Shelter.all
---
SELECT "shelters".* FROM "shelters"

  def create
    @shelter = Shelter.new(shelter_params)

    if @shelter.valid?
      @shelter.save
---
INSERT INTO "shelters" ("name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Happy Animals"], ["address", "11111 Great Falls, MD"], ["created_at", "2018-07-31 18:27:45.552089"], ["updated_at", "2018-07-31 18:27:45.552089"]]

  def show
    @shelter = Shelter.find(params[:id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]