app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Joshua"], ["last_name", "Miller"], ["address", "119 Merlot Dr"], ["created_at", "2018-07-31 17:44:22.621494"], ["updated_at", "2018-07-31 17:44:22.621494"]]
---
  def create
    @user = User.new(user_params)

    if @user.valid?
      @user.save