app/models/animal.rb

SELECT "animals".* FROM "animals"
---
  def self.filter(name)
    all.select{|animal| name.downcase == animal.type_of_animal.name.downcase}